doc.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2016-03-31 Thu 15:38 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title></title>
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Affan Salman" />

</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline2">1. FDW DDL</a>
<ul>
<li><a href="#orgheadline1">1.1. SERVER OPTIONs</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline2" class="outline-2">
<h2 id="orgheadline2"><span class="section-number-2">1</span> FDW DDL</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-orgheadline1" class="outline-3">
<h3 id="orgheadline1"><span class="section-number-3">1.1</span> SERVER OPTIONs</h3>
<div class="outline-text-3" id="text-1-1">
<p>
The key-value pairs specified in the OPTIONS clause of the CREATE SERVER
command; e.g. the OPTION <code>host</code> is specified with a value '127.0.0.1' in
the example below:
</p>

<div class="org-src-container">

<pre class="src src-sql"><span style="color: #a020f0;">CREATE</span> <span style="color: #483d8b;">SERVER</span> cass_serv <span style="color: #a020f0;">FOREIGN</span> <span style="color: #483d8b;">DATA</span> <span style="color: #483d8b;">WRAPPER</span> cstar_fdw
    <span style="color: #483d8b;">OPTIONS</span> (<span style="color: #483d8b;">host</span> <span style="color: #8b2252;">'127.0.0.1'</span>);
</pre>
</div>

<p>
The full list of the supported SERVER OPTIONs follows:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Key</th>
<th scope="col" class="org-left">Required</th>
<th scope="col" class="org-left">Description</th>
<th scope="col" class="org-left">Example Values</th>
<th scope="col" class="org-left">Default Value</th>
</tr>
</thead>
<tbody>
<tr class="tr-odd">
<td class="org-left">host</td>
<td class="org-left">Y</td>
<td class="org-left">The address(es) or hostname(s) of the Cassandra server(s)</td>
<td class="org-left">"127.0.0.1", "127.0.0.1,127.0.0.2", "server1.domain.com"</td>
<td class="org-left">N/A</td>
</tr>

<tr class="tr-even">
<td class="org-left">port</td>
<td class="org-left">N</td>
<td class="org-left">The port number of the Cassandra server(s)</td>
<td class="org-left">9042</td>
<td class="org-left">9042</td>
</tr>

<tr class="tr-odd">
<td class="org-left">protocol</td>
<td class="org-left">N</td>
<td class="org-left">The protocol version to use for connecting with the Cassandra server</td>
<td class="org-left">"4"</td>
<td class="org-left">"4" (for cpp-driver 2.3)</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Affan Salman</p>
<p class="date">Created: 2016-03-31 Thu 15:38</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
